tsung_scripts/tsung_buyer_login.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="32768" use_controller_vm="true" />
  </clients>

  <servers>
    <!--server host="localhost" port="3000" type="tcp"></server-->
    <server host="arjun.eba-fbpd2mid.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
    <!--server host="arjun.eba-fbpd2mid.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server-->
  </servers>

  <load>
    <arrivalphase phase="1" duration="60" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="60" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="60" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="60" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="60" unit="second">
      <users arrivalrate="32" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="6" duration="60" unit="second">
      <users arrivalrate="64" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="7" duration="60" unit="second">
      <users arrivalrate="128" unit="second"></users>
    </arrivalphase>    
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="3000"></option>
  </options>

  <sessions>
    <session name="buyer_login" type="ts_http" weight="1">

        <setdynvars sourcetype="random_number" start="1" end="100">
          <var name="rand_buyer"/>
        </setdynvars>
        
        <request>
          <dyn_variable name="authenticity_token"></dyn_variable>
          <http method="GET" url="/buyers/sign_in"></http>
        </request>
        <!--thinktime value="1" random="true"></thinktime-->
        <setdynvars code='fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,"[+]","%2B",[global,{return,list}]) end.' sourcetype="eval"> <var name="authenticity_token" /> </setdynvars>

        <arrivalphase phase="7" duration="60" unit="second">
          <users arrivalrate="64" unit="second"></users>
        </arrivalphase>

        <request subst="true">
          <http url="/buyers/sign_in" version="1.1" method="POST"
            contents="buyer[email]=buyer%%_rand_buyer%%@example.com&amp;authenticity_token=%%_authenticity_token%%&amp;
                      buyer[password]=password&amp;commit=Log+in"
            content_type="application/x-www-form-urlencoded">
          </http>
        </request>


        
        <setdynvars sourcetype="random_number" start="5001" end="10000">
          <var name="item_1"/>
        </setdynvars>
        <setdynvars sourcetype="random_number" start="5001" end="10000">
          <var name="item_2"/>
        </setdynvars>
        
        <request subst="true">
          <http url="/cart/%%_item_1%%" version="1.1" method="POST"
            contents="authenticity_token=%%_authenticity_token%%"
            content_type="application/x-www-form-urlencoded">
          </http>
        </request>

        <request subst="true">
          <http url="/cart/%%_item_2%%" version="1.1" method="POST"
            contents="authenticity_token=%%_authenticity_token%%"
            content_type="application/x-www-form-urlencoded">
          </http>
        </request>

        <request>
          <dyn_variable name="authenticity_token"></dyn_variable>
          <http method="GET" url="/showcart"></http>
        </request>
        <setdynvars code='fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,"[+]","%2B",[global,{return,list}]) end.' sourcetype="eval"> <var name="authenticity_token" /> </setdynvars>

        <request subst="true">
          <http url="/orderplaced" version="1.1" method="POST"
            contents="authenticity_token=%%_authenticity_token%%&amp;
            helo=%%_authenticity_token%%&amp;requestparam=%7B%22body%22%3A%5B%7B%22item_id%22%3A%22300%22%2C%22quantity%22%3A%221%22%7D%5D%7D"
            content_type="application/x-www-form-urlencoded">
          </http>
        </request>
      
    </session>
  </sessions>
</tsung>